Revit 2026 API

# ExternalResourceLoadContextGetCurrentlyLoadedReference Method

---

Returns a copy of the ExternalResourceReference currently in use by the containing element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExternalResourceReference GetCurrentlyLoadedReference()
```
```vb
Public Function GetCurrentlyLoadedReference As ExternalResourceReference
```
```cpp
public:
ExternalResourceReference^ GetCurrentlyLoadedReference()
```
```fsharp
member GetCurrentlyLoadedReference : unit -> ExternalResourceReference
```

#### Return Value

ExternalResourceReference A copy of the ExternalResourceReference currently in use by the containing element.

A server may use to wish this information to, for example, tell whether the Revit user was previously using their server or not.

This reference may be  if there is no current value. For example, a newly-created link being loaded for the first time would have no currently-loaded reference.

#### Reference

ExternalResourceLoadContext Class

Autodesk.Revit.DB Namespace